<template>
  <div :key="this.$route.query.detailID">
    <h2 class="h2-back" @click="switchTo('/EventPage')"> < </h2>
    <h3 class="detail-title">{{newsList[(this.$route.query.detailID-1)].title}}</h3>
    <p class="detail-time">作者：{{newsList[(this.$route.query.detailID-1)].author}}</p>
    <p class="detail-time">{{newsList[(this.$route.query.detailID-1)].time}}</p>
    <p class="detail-main">{{newsList[(this.$route.query.detailID-1)].detail}}</p>
  </div>
</template>

<script>
export default {
  name: "EventDetail",
  data() {
    return {
      newsList:[
        {
          "id":"1",
          "title":"桂林理工大学铺面招租公告",
          "author":"桂林理工大学信息发布处",
          "time":"2021-09-23",
          "detail":"一、铺面基本概况\n" +
            "\n" +
            "桂林理工大学拟对屏风校区D区3间(七星区环城北二路56-2号)、E区1间(屏风校内8#女生宿舍一层)、F区4间(屏风1号留学生公寓一层)和雁山校区D区1间（雁山东大门创客基地）共9间铺面对外公开招租，欢迎符合条件的单位或个人参加，现将有关事项公告如下：",
        },
        {
          "id":"2",
          "title":"关于开展2021年秋季全国地方版图书线上采购活动的通知",
          "author":"桂林理工大学信息发布处",
          "time":"2021-09-23",
          "detail":"　为了响应中宣部办公厅《关于做好2021年全民阅读工作的通知》，积极推动形成爱读书、读好书、善读书的新风尚，图书馆和图书供应商特组织2021年秋季全国地方版图书博览会暨图书线上采购活动，此次活动时间为9月23日至9月30日，共有来自全国500多家出版单位，近20万种图书参展。\n" +
            "\n" +
            "　　为进一步满足师生的教学科研需要和广大读者的阅读需求，不断提升图书馆的文献资源保障水平，现诚邀广大师生读者一起参与本次全国地方版图书的线上采购活动，欢迎大家积极参与。\n" +
            "\n" +
            "　　具体操作流程和方法，详见附件1《全国地方版图书线上采购操作说明》。",
        },
        {
          "id":"3",
          "title":"关于试鸣防空警报的通知",
          "author":"桂林理工大学信息发布处",
          "time":"2021-09-16",
          "detail":"校属各单位、各部门：\n" +
            "\n" +
            "　　按照《中华人民共和国人民防空法》的有关规定，接桂林市人民政府和市人防办通知，定于2021年9月18日上午10:00分至10:15分，全桂林市统一组织防空警报器进行试鸣。请师生员工正常进行日常的工作、生活、学习。",
        },
        {
          "id":"4",
          "title":"关于安全节约用电的通知",
          "author":"桂林理工大学信息发布处",
          "time":"2021-09-10",
          "detail":"校属各单位、各部门、全体师生：\n" +
            "\n" +
            "近段时间内都是持续高温天气，随着学校建筑的增多和学生公寓空调安装的完成，学校的用电量显著增加。近日接供电局通知，为解决良丰站负荷压力，供电局将部分负荷改接至大埠站用电，但由于9月8日大埠站主线路问题造成全站停电，现又将原来改接的用户由良丰站供电，造成良丰站主变超负荷供电。我校雁山校区供电来自良丰站及乐园站新建专线，为有效降低因为用电超负荷而出现跳闸停电的风险和用电而导致的火灾事故，切实做好安全用电、科学用电、节约用电工作，现将有关事项通知如下：\n" +
            "\n" +
            "       一、各单位、各部门要根据自身实际，强化办公场所节约用电的各项措施，以身作则、率先垂范，带头做好节约用电、安全用电工作。\n" +
            "\n" +
            "       二、人离开时，须关闭电器设备，下班、下课后应切断除必要设施外所有的用电设施，如电器设备在使用过程中，发生打火、异响、异味等情况时，须立即关闭电器设备，查找原因，或寻求专业人员处理，在确保安全后方可继续使用；\n" +
            "\n" +
            "       三、办公、实验室、公共教室等场所在日最高气温30℃以上时方可使用空调，空调温度设置不低于26℃。冬季安装有制热空调设备的，设置温度不应高于20℃，禁止使用取暖器、电热炉等取暖设备，在避免能源浪费的同时防止内部电力线路负荷过大引起空开跳闸甚至线路起火等情况的出现；\n" +
            "\n" +
            "      四、要注重用电设备节电，使用计算机、打印机、复印机等办公自动化设备时，要开启省电模式功能，严禁在办公场所使用大功率电器；\n" +
            "\n" +
            "      五、充分利用自然光照，减少照明设备电耗。公共阅览室、教室、自习室及实验室在人少时，及时关闭不必要的电灯及空调等电器设备；\n" +
            "\n" +
            "      六、加强对实验室、体育馆、图书馆等大型用电设备的节能管理，合理开启设备数量；\n" +
            "\n" +
            "      七、加强对电梯用电设备的节能管理，合理安排电梯停靠楼层和开启时间，4层以下楼层倡导步行，不乘坐电梯，积极倡导低碳健康、绿色环保的工作生活方式。\n" +
            "\n" +
            "      希望各单位、各部门及全体师生自觉遵守，减少能源浪费，养成安全用电、节约用电的良好习惯。\n" +
            "\n" +
            "      特此通知。",
        },
        {
          "id":"5",
          "title":"关于2021年迎新期间雁山校区大门封闭管理的通知",
          "author":"桂林理工大学信息发布处",
          "time":"2021-09-07",
          "detail":"校属各单位、各部门：\n" +
            "\n" +
            "　　根据《桂林理工大学2021级新生入学工作方案》，我校2021级新生入学时间为2021年9月11日-12日。为做好迎新期间的校门防控管理工作，经研究决定，现将雁山校区校门管理的有关事项通知如下：\n" +
            "\n" +
            "　　一、2021年9月10日14点00分至2021年9月12日17点，雁山校区东大门实施封闭管理，用于学生返校专用通道。\n" +
            "\n" +
            "　　二、2021年9月10日14点00分至2021年9月12日17点，雁山校区机动车辆、非机动车辆及行人请绕行雁山校区南大门。\n" +
            "\n" +
            "　　三、上述通知请教职工相互转告，并告知居住在校区内的家属、租户、后勤务工及工地施工人员等，请教职工和家属自觉遵守学校相关出行管理规定，配合门岗做好相关疫情防控工作，感谢大家的理解和配合。"
        },
        {
          "id":"6",
          "title":"关于开展2021年秋季线上图书采购活动的通知",
          "author":"桂林理工大学信息发布处",
          "time":"2021-09-16",
          "detail":"　　为了适应疫情期间各高校选采图书的需要，图书供应商特组织线上平台图书采购活动。为更好地开展图书馆图书资源建设，满足师生读者的教学科研需要，不断提升馆藏图书保障水平，图书馆诚邀各位师生读者一起参与本次线上图书选购活动，欢迎全校广大师生读者积极参与。\n" +
            "\n" +
            "　　具体操作流程和方法，详见附件1《线上图书采购操作说明》。"
        },
      ]
      // newsList:[
      //   {
      //     "id":"0001",
      //     "title":"关于关于18级三大郭楠成功入狱",
      //     "author":"QQ小斌",
      //     "time":"2021-09-21",
      //     "detail":"近日，警方收到学生举报，称桂林理工大学18级有三个郭楠调戏大一学妹。警方听后火速出警，迅速抓捕了嫌疑犯三人：李某锋，丘某榆，宁某漫，等待法院制裁",
      //   },
      //   {
      //     "id":"0002",
      //     "title":"震惊！刘畜拿张畜的爹顶命逃过一劫！",
      //     "author":"QQ小斌",
      //     "time":"2021-09-23",
      //     "detail":"警方调查发现，竟是波哥花大价钱请斌半仙做法弄s刘畜，但道高一尺魔高一丈，未能伤着刘畜，原因竟是刘畜用自己心爱弟子的爹爹顶命！这到底是道德的沦丧还是人性的缺失？",
      //   },
      //   {
      //     "id":"0003",
      //     "title":"秋招找工作难？蓝桥学子表示：很难？就这？",
      //     "author":"QQ小斌",
      //     "time":"2021-09-17",
      //     "detail":"近日，桂林理工大学蓝桥信息与工程学院的学子们迎来了线下外包洗脑式招聘。刘畜放出狠话：三天之内撒了你，不对，三天之内offer破100！蓝桥学子们也都获得了自己满意的外包，但即使是这样！还是有两个老鼠人没找到工作，这里就不方便透露是谁了，毕竟也不好把林xx和梁xx的信息泄露出去",
      //   },
      // ]
      // activeName: 'first'
    };
  },
  methods: {
    switchTo(path){
      // console.log(this.$router)
      this.$router.replace(path)
    }
  }
}
</script>

<style scoped>
.h2-back{
  width: 25px;
  margin-top: 0;
}
.detail-title{

}
.detail-time{
  font-size: 13px;
  color: #666666;
}
.detail-main{

}
</style>
